import { Translations } from "./en"

const ur: Translations = {
	morning: {
		zikars: [
			{
				arabic: ["اٰيَةُ الْكُرْسِي"],
				translation: [""],
				// arabicReference: "(سورة البقرة : 255)",
				description: "پڑھنے واّل شیطان اور جنات سے محفوظ ہوجاتا ہے اور اسکی حفاظت کیلئے ایک محافظ مقرر کر دیا جاتا ہے",
				reference: "بخارى : 2311 ، السنن الكبرى للنسائي : 8017 ، المستدرك للحاكم : 2064",
				frequency: "1 مرتبہ صبح اور شام"
			},
			{
				arabic: ["قُلْ هُوَ اللهُ أَحَدٌ", "قُلْ أَعُوْذُ بِرَبِّ الْفَلَقِ", "قُلْ أَعُوْذُ بِرَبِّ النَّاسِ"],
				translation: [""],
				// arabic: ["مُعَوِّذَات"],
				description: "مُعَوِّذَات کی تلاوت ( جنات اور جادو کے خلاف ) ہر شے سے کافی ہو جاتی ہے ",
				reference: "جامع ترمذی : 3575 ، سنن ابی داود : 5082",
				frequency: "تینوں 3 مرتبہ صبح اور شام",
			},
			{
				arabic: ["لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُوَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ"],
				translation: ["نہیں کوئی معبود مگر اللہ، وہ اکیلا ہے، نہیں کوئی شریک اُسکا، اُسی کی بادشاہی ہے، اور اُسی کے لئے سب تعریفیں ہیں، اور وہ ہر شے پر پوری طرح قدرت رکھتا ہے"],
				description: "یہ کلمات پڑھنے والے کو 4 غلام آزاد کرنے کا ثواب ملتا ہے اور تمام دن رات میںہر خطرناک چیز اور شیطان کے خلاف اُسکا بچاؤ ہو جاتا ہے",
				reference: "مسلم : 6844 ، سنن ابی داؤد : 5077",
				frequency: "مرتبہ صبح اور شام10",
				note: "نوٹ : ہر روز 100 بار پڑھنا افضل ترین عمل ہے : [ بخاری : 6403 ، مسلم : 6842]"
			},
			{
				arabic: ["رَضِيتُ بِاللهِ رَبَّا وَ بِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَّبِيًّا"],
				translation: ["راضی ہوں میں اللہ کے رب ہونے پر، اور اسلام کے دین ہونے پر، اور محمد ﷺ کے نبی ہونے پر"],
				description: "یہ کلمات پڑھنے والے پر جنت واجب ہو جائیگی اور قیامت والے دن اللہ اسے خوش کر دے گا",
				reference: "سنن ابی داؤد : 5072 ، مسند احمد : 18990",
				frequency: "مرتبہ صبح اور شام3"
			},
			{
				arabic: ["بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ"],
				translation: ["اللہ کے نام کے ساتھ، جس کے نام کے ساتھ زمین و آسمان میں کوئی چیز نقصان نہیں پہنچا سکتی،اور وہی سننے والا جاننے والا ہے"],
				description: "یہ کلمات پڑھنے والے کو نہ تو کوئی شے نقصان پہنچا سکتی ہے اور نہ ہی کوئی اچانک نا گہانی مصیبت اُسے پہنچے گی :",
				reference: "جامع ترمذی : 3388 ، سنن ابی داؤد : 5088",
				frequency: "مرتبہ صبح اور شام3"
			},
			{
				arabic: ["أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ"],
				translation: ["میں اللہ کے کلمات کا ملہ کی پناہ پکڑتا ہوں ہر اُس چیز کے شر سے جو اُس نے پیدا کی"],
				description: "یہ کلمات پڑھنے والے کو زہر یلے جانور کا ڈنگ نقصان نہیں پہنچا سکے گا",
				reference: "290/2 ، 7885 : مسلم : 6880 ، مسند احمد",
				frequency: "مرتبہ صبح اور شام3"
			},
			{
				arabic: ["سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَى نَفْسِهِ وَزِنَةً عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ"],
				translation: ["میں اللہ کے کلمات کا ملہ کی پناہ پکڑتا ہوں ہر اُس چیز کے شر سے جو اُس نے پیدا کی"],
				description: "اللہ پاک ہے اور اپنی تعریف کے ساتھ ہے، اپنی مخلوق کی گنتی کے برابر، اور اپنے نفس کی رضا کےبرابر، اور اپنے عرش کے وزن کے برابر، اور اپنے کلمات کی سیاہی کے برابر",
				reference: "6913 :مسلم",
				frequency: "مرتبہ صبح اور شام3",
				note: "[ سنن ابی داؤد : 5090]	نوٹ : اَللَّهُمَّ عَافِنِي فِي بَدَني ...... دعا کی حدیث کی سند میں ایک راوی جعفر بن میمون جمہور محدثین کے نزدیک ضعیف ہے"
			},
			{
				arabic: ["اَسْتَغْفِرُ اللّٰهَ الَّذِي لَا إِلٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَاَتُوبُ إِلَيْهِ "],
				translation: ["میں اللہ کے کلمات کا ملہ کی پناہ پکڑتا ہوں ہر اُس چیز کے شر سے جو اُس نے پیدا کی"],
				description: "میں اللہ سے مغفرت طلب کرتا ہوں، نہیں کوئی معبود مگر وہ خود سے زندہ، ہر چیز کو قائم رکھنے والاہے اور میں اُس کی طرف تو بہ کرتا ہوں",
				reference: "جامع ترمذی : 3577 ، سنن ابی داؤد : 1517",
				frequency: "مرتبہ صبح اور شام3",
			},
			{
				arabic: ["اَلّٰلهُمَّ أَجِرْنِي مِنَ النَّارِ"],
				translation: ["اے اللہ ! بچالے مجھ کو آگ سے"],
				description: "یہ کلمات جو کوئی نماز مغرب کے بعد گفتگو کرنے سے پہلے پڑھ لے اور اگر اسی رات فوت ہو گیا تو دوزخ کی آگ سے آزاد ہو گا اور جو بھی نماز فجر کے بعد گفتگو سے پہلے یہ کلمات پڑھے اور اُسی دن اُسے موت آگئی تو دوزخ کی آگ سے آزاد ہوگا",
				reference: "سنن ابی داود : 5079",
				frequency: "7 مرتبہ نماز فجر اورنماز مغرب کے فورا بعد",
			},
			{
				arabic: ["اَللّٰهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ"],
				translation: ["اے اللہ ! ہم نے تیرے نام کے ساتھ صبح کی اور تیرے نام کے ساتھ شام کی اور تیرے ہی نام کے ساتھ ہم زندہ ہیں اور تیرے ہی نام کے ساتھ ہم مریں گے اور تیری ہی طرف پلٹنا ہے"],
				reference: "جامع ترمذی : 339",
			},
			{
				arabic: ["أَصْبَحْنَا عَلٰى فِطْرَةِ الْإِسْلَامِ وَعَلٰى كَلِمَةِ الْإِخْلَاصِ وَعَلٰى دِينِ نَبِيِّنَا مُحَمَّدٍ وَ عَلٰى مِلَّةِ أَبِيْنَا إِبْرَاهِيمَ حَنِيفًا مُّسلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ"],
				translation: ["ہم نے صبح کی ہم نے شام کی فطرت اسلام اور کلمہ اخلاص پر اور ہمارے نبی ﷺ کے دین اورباپ ابراہیم یکسو مسلم کی ملت پر اور وہ مشرک نہیں تھے"],
				reference: "مسند احمد : 406/3،15397",
			},
			{
				arabic: ["أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، رَبِّ أَسْأَلُكَ خَيْرٌ مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابِ فِي الْقَبْرِ"],
				translation: ["ہم نے صبح کی اور اللہ کے ملک نے صبح کی اور تمام تعریف اللہ کیلئے ہے۔ نہیں کوئی معبود مگر الله، وہ اکیلا ہے، نہیں کوئی شریک اسکا، اُسی کی بادشاہی ہے، اور اُسی کے لئے سب تعریفیں ہیں، اور وہ ہر شے پر پوری طرح قدرت رکھتا ہے۔ اے میرے رب ! میں سوال کرتا ہوں تجھ سے اس دن میں جو خیر ہے اور جو اسکے بعد ہے۔ اور تیری پناہ میں آتا ہوں اس ون کے شرسے اور جوشر اسکے بعد ہے۔ اے میرے رب ! تیری پناہ میں آتا ہوں سستی اور بڑھاپے کی بُرائی سے۔ اے میرے رب ! تیری پناہ میں آتا ہوں آگ کے عذاب اور قبر کے عذاب سے"],
				reference: "مُسلم : 6908",
			}
		]
	}
}

export default ur
